In [ ]:
#Домашняя работа 5 ФИО:Михайлова Ксения

In [1]:
import numpy as np
import pandas as pd

In [2]:
#1

In [3]:
def array_reverse (num_n): #numpy array с элементами от числа N до 0
    nums = []
    for i in range(0, num_n):
         nums.append(i)
            
    nums.sort(reverse=True) 
    x = np.array( nums )
    
    return x

In [4]:
array_reverse (14)

array([13, 12, 11, 10,  9,  8,  7,  6,  5,  4,  3,  2,  1,  0])

In [5]:
#2

In [6]:
def sum_diag_matrix(n): #сумма значений на диагонали диагональной матрицы
        result = sum(np.diag(np.arange(n), k=0)[i][i] for i in range(n))
        return result

In [7]:
sum_diag_matrix(5)

10

In [8]:
#3

In [38]:
ratings = pd.read_csv('ratings.csv')

In [39]:
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [41]:
top_rate = ratings[ratings['rating'] == 5.0].groupby(by=['movieId'])['rating'].count().sort_values(ascending=False)

In [42]:
top_rate.head(1) # находим ид фильма с самым большим количеством оценки 5.0

movieId
318    170
Name: rating, dtype: int64

In [43]:
movies = pd.read_csv('movies.csv')

In [44]:
movies[movies['movieId'] == 318 ].head()  #находим название фильма по ид

     movieId                             title       genres
284      318  Shawshank Redemption, The (1994)  Crime|Drama

In [ ]:
#4

In [45]:
data = pd.read_csv('power.csv')

In [46]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [49]:
countries = data[(data['country'] == 'Latvia') | (data['country'] == 'Lithuania') | (data['country'] == 'Estonia')               
                ]

In [50]:
countries.head() #фильтр по странам

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [51]:
category_filtred = countries[(countries['category'] == 4 ) | (countries['category'] == 12 ) | (countries['category'] == 21 )]

In [52]:
category_filtred.head() # фильтр по категориям

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [ ]:
# считаем по странам

In [63]:
sum_by_counrty = category_filtred[(category_filtred['year'] >= 2005 ) & (category_filtred['year'] <= 2010 ) & (category_filtred['quantity'] >= 0 )].groupby(by=['country'])['quantity'].sum()

In [ ]:
# считаем финальный результат

In [65]:
sum_by_counrty.sum()

240580.0

In [ ]:
 (data['quantity'] >= 0 )

In [ ]:
#5 решаем систему уравнений

In [25]:
a = np.array( [ [4, 2, 1], [1, 3, 0], [0, 5, 4] ] )

In [26]:
b = np.array( [4, 12, -3] )

In [27]:
from numpy import linalg

In [28]:
linalg.solve(a, b)

array([ 0.46666667,  3.84444444, -5.55555556])

In [29]:
np.allclose( np.dot(a, linalg.solve(a, b)), b )

True